about_msg = """
    <b>SinPdf версия {version}</b>
    <p>Быстрый поиск по содержимому PDF файлов</p>
    <p>Вы можете скачать последнюю версию здесь:</p>
    <p><a href="https://github.com/Rifgy/sinpdf.git">https://github.com/Rifgy/sinpdf.git</a></p>
    <p>Copyright &copy; 2025-{year}, Rifgy</p>
    <p>Эта программа является свободным программным обеспечением:
    вы можете распространять ее и/или изменять в соответствии с
    условиями <b>MIT License</b>, опубликованной Open Source Initiative.</p>
    <p>Данная программа распространяется в надежде, что она будет
    полезна, но БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ; даже без подразумеваемой
    гарантии ТОРГОВОЙ ПРИГОДНОСТИ или ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ
     ЦЕЛИ.
"""

help_msg = ""
MSG = {
    'help': help_msg,
    'about': about_msg,
}

if __name__ == "__main__":
    pass